{
  "education": [
    {
      "awards_achievements": [
        "Internationl Student Scholarship",
        "GPA: 3.0/4.0"
      ],
      "degree": "Bachelor of Computer Science",
      "department": "Lassonde School of Engineering",
      "duration": "2019-2021",
      "school_name": "York University"
    },
    {
      "awards_achievements": [
        "Class Rank: 1st/350",
        "Selected for Articulation Program",
        "GPA: 3.7/4.0"
      ],
      "degree": "Bachelor of Engineering CSE ",
      "department": "Computer Engineering",
      "duration": "2017-2019",
      "school_name": "Chitkara University "
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_ShubhkarmanSandhu",
  "highlighted_projects": [
    {
      "description": "Personal portfolio developed with react framework and published using vercelcloud computing and GitHub pages.",
      "git_url": "https://github.com/LordSandhu/Portfolio",
      "name": "React Portfolio"
    },
    {
      "description": "Parking ticket system for Toronto using Java as backend with Java-GUI as graphic interface. State Design Pattern implemented with UML diagrams in agile environment and dual programming.",
      "git_url": "https://github.com/LordSandhu/ParkingTicket-Project-Java",
      "name": "Software Design Project"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Linux Cluster Monitoring Agent is a tool that will allow users to collect, monitor, compare and generate reports of system hardware specifications and performance for a group of Linux systems on a server. Programmed with bash scripts and automated with crontab for data collection and stored into a PostgreSQL database hosted by Docker. Collected can be returned as a result set by using SQL queries, including detecting crontab insertion failure using SQL aggregate functions to compare the number of entries within five minutes. This app was developed and run within a CentOS 7 environment using Docker.",
      "git_url": "/linux_sql",
      "name": "Linux Cluster Monitoring Agent"
    },
    {
      "description": [
        "Twitter App: In progress",
        "JDBC App: Practice project to gain experience and knowledge of the java database connections API between java and PostgreSQL.The connection is DAO pattern based,the driver class creates and handles the connection to the database itself,two DAO classes has been developed for CRUD operations like INSERT, SELECT, UPDATE, and DELETE. Technologies used:- Java 1.8, Postgresql, Dbeaver, Maven, Docker, Git, IntelliJ IDE, SQL queries",
        "Grep App: Java grep is an app that impersonates the functionality of the grep bash command of Linux(Match pattern in files in a given directory). App accepts a directory path, then reads all files and match a given pattern in the each file line by line.Docker container is also created and uploaded to use the app ,along with Fat-jar execution file. Technologies used:- Java 1.8, Maven, Docker, Git, IntelliJ IDE"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "In progress",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "In progress",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Shubhkarman Singh Sandhu",
  "others": [
    {
      "bullets": [
        "The Ultimate React Native Series: Fundamentals",
        "Mastering React",
        "The Complete Node.js Course"
      ],
      "title": "Certificates"
    },
    {
      "bullets": [
        "Watching sports:- Cricket,Football",
        "Casual Gamer",
        "Historic and Fantasy Movies and TV hows"
      ],
      "title": "Activities/Hobbies"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Developed various applications using an Agile methodology. Acted as a team lead in organizing and leading daily scrum meetings with the team. Java, Linux, SQL, Docker, and bash scripts were used in developing. I also gained more experience with team collaboration and organization skills related to scrum through the use of scrum board for projects to manage my sprint backlog. Leadership was another soft skill gained from the Jarvis opportunity since every new sprint allows a developer to take on the role of team lead and direct the group in scrum meetings. My ability to problem-solve has increased because of the challenges and questions posed by the assignments to ensure that I understand the technical aspects of the projects being developed and can relate the concepts to my prior knowledge.",
      "duration": "2022-present",
      "title": "Software Developer"
    },
    {
      "company": "Aavenir",
      "description": "Implemented websites, mobile applications, and landing pages from concept through deployment,standardized all output with a new, responsive, mobile-first approach and strategy,accessed UX and UI designs for technical feasibility. ",
      "duration": "India (2018-2019)",
      "title": "Front End Developer"
    }
  ],
  "skills": {
    "competent": [
      "React",
      "JavaScript",
      "Visual Studio Code",
      "Eclipse",
      "Docker"
    ],
    "familiar": [
      "JDBC",
      "Node.js",
      "React-Native",
      "IntelliJ IDEA",
      "Maven"
    ],
    "proficient": [
      "Java",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "Git"
    ]
  },
  "summary": "I am a Bachelor of Computer Science graduate from Lassonde School of Engineering, York University. I came to york through an articulation program from Chitkara University, India. , I worked as a trainee at Aavenir Inc, primarily focused on Front-end Development. Before York, I worked as a trainee at Aavenir Inc, primarily focused on Front-end Development. I got this opportunity by winning a website-making Hackathon at my old School, Chitkara University. I gained solid programming, UI/UX, and designing skills while working there. Currently, I am a Junior Software Developer at Jarvis.I am especially passionate about using technical skills to solve problems for a wide variety of stakeholders."
}
